In [2]:
import numpy as np
import pandas as pd

In [4]:
np.array([10,20,30,40,50])

array([10, 20, 30, 40, 50])

In [6]:
pd.Series([10,20,30,40,50])

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [8]:
pd.Series([10,20,30,40,50],[55,65,75,85,95])

55    10
65    20
75    30
85    40
95    50
dtype: int64

In [10]:
series1=pd.Series([10,20,30,40,50])
series2=pd.Series([100,200,300,400,500])
series1+series2

0    110
1    220
2    330
3    440
4    550
dtype: int64

In [13]:
series3=pd.Series(["Ayush","Divya","Vinayak","Rahul"],["name1","name2","name3","name4"])
series3

name1      Ayush
name2      Divya
name3    Vinayak
name4      Rahul
dtype: object

In [15]:
series4=pd.Series(["Ayush","Divya","Vinayak","Rahul","Divya","Vinayak","Rahul"],["name1","name100","name2","name3","name4","name5","name6"])

In [17]:
series4

name1        Ayush
name100      Divya
name2      Vinayak
name3        Rahul
name4        Divya
name5      Vinayak
name6        Rahul
dtype: object

In [19]:
series3+series4

name1        AyushAyush
name100             NaN
name2      DivyaVinayak
name3      VinayakRahul
name4        RahulDivya
name5               NaN
name6               NaN
dtype: object

In [38]:
dataframe_new=pd.DataFrame(np.random.randn(5,2),["a","b","c","d","e"],["Column1","Column2"])

In [49]:
dataframe_new

   Column1  Column2
a        0        1
b        2        3
c        4        5
d        6        7
e        8        9

In [57]:
tammana=pd.DataFrame(np.array([10,20,30,40]).reshape(2,2),[0,1],["Column_one","Column_two"])
print(tammana)

   Column_one  Column_two
0          10          20
1          30          40

In [41]:
dataframe_new=pd.DataFrame(np.arange(10).reshape(5,2),["a","b","c","d","e"],["Column1","Column2"])

In [43]:
dataframe_new

   Column1  Column2
a        0        1
b        2        3
c        4        5
d        6        7
e        8        9

In [48]:
dataframe_new["Column1"]

a    0
b    2
c    4
d    6
e    8
Name: Column1, dtype: int32

In [59]:
dataframe_new["Column3"]=dataframe_new["Column1"]+dataframe_new["Column2"]

In [61]:
dataframe_new

   Column1  Column2  Column3
a        0        1        1
b        2        3        5
c        4        5        9
d        6        7       13
e        8        9       17

In [64]:
dataframe_new.drop("Column3",axis=1)

   Column1  Column2
a        0        1
b        2        3
c        4        5
d        6        7
e        8        9

In [66]:
dataframe_new

   Column1  Column2  Column3
a        0        1        1
b        2        3        5
c        4        5        9
d        6        7       13
e        8        9       17

In [70]:
dataframe_new.drop("Column3",axis=1,inplace=True)

In [71]:
dataframe_new

   Column1  Column2
a        0        1
b        2        3
c        4        5
d        6        7
e        8        9